//
//  main.swift
//  geekbrains
//
//  Created by light on 03/03/2019.
//  Copyright © 2019 light. All rights reserved.
//

import Foundation

/*
 Описать класс Car c общими свойствами автомобилей и пустым методом действия по аналогии с прошлым заданием.
 Описать пару его наследников TrunkCar и SportCar. Подумать, какими отличительными свойствами обладают эти автомобили. Описать в каждом наследнике специфичные для него свойства.
 Взять из прошлого урока enum с действиями над автомобилем. Подумать, какие особенные действия имеет TrunkCar, а какие – SportCar. Добавить эти действия в перечисление.
 В каждом подклассе переопределить метод действия с автомобилем в соответствии с его классом.
 Создать несколько объектов каждог
 о класса. Применить к ним различные действия.
 Вывести значения свойств экземпляров в консоль.
 */


